/** @file

Copyright (c) 2006 - 2014, Byosoft Corporation.<BR>
All rights reserved.This software and associated documentation (if any)
is furnished under a license and may only be used or copied in
accordance with the terms of the license. Except as permitted by such
license, no part of this software or documentation may be reproduced,
stored in a retrieval system, or transmitted in any form or by any
means without the express written consent of Byosoft Corporation.

File Name:
  Audio.uni

Abstract:
  The definition of string used in Audio Setup setting.

Revision History:

$END--------------------------------------------------------------------

**/

/=#
#langdef   en-US "English"
#langdef   zh-Hans "\wide中文\narrow"

                                           
#string STR_IOE_FORM                     #language en-US   "IOE Setup"                                           
#string STR_IOE_FORM_HELP                #language en-US   "Select this option to configure your system's IOE."
#string STR_IOE_PCIE_PTN_FORM                     #language en-US "IOE PCIE PTN Setup"
#string STR_IOE_PCIE_PTN_FORM_HELP                     #language en-US "IOE PCIE PTN Configuration"
#string STR_EMPTY                              #language en-US " "
#string STR_IOE_PHY_CFG 						#language en-US "PHY CFG SOURCE"
#string STR_IOE_PHY_CFG_FIXED 						#language en-US "Fixed"
#string STR_IOE_PHY_CFG_MANUAL 						#language en-US "Manual Set"
#string STR_IOE_PHY_CFG_HELP						#language en-US "Configure PHY form SetupMenu Or a fixed platform special config"
#string STR_IOE_PHYA_CFG                                #language en-US "PHYA CFG"
#string STR_IOE_PHYB_CFG                                #language en-US "PHYB CFG"
#string STR_IOE_EPCAP                                #language en-US "PEEP Cap"
#string STR_DISABLED                      #language en-US "Disabled"
#string STR_ENABLED                              #language en-US "Enabled"
#string STR_CFG0                                 #language en-US "CFG 0"
#string STR_CFG1                                 #language en-US "CFG 1"
#string STR_CFG2                                 #language en-US "CFG 2"
#string STR_CFG3                                 #language en-US "CFG 3"
#string STR_IOE_CAP_PEA0                                 #language en-US "PEA0 Cap"
#string STR_IOE_CAP_PEA1                                 #language en-US "PEA1 Cap"
#string STR_IOE_CAP_PEA2                                 #language en-US "PEA2 Cap"
#string STR_IOE_CAP_PEA3                                 #language en-US "PEA3 Cap"
#string STR_IOE_CAP_PEA4                                 #language en-US "PEA4 Cap"
#string STR_IOE_CAP_PEB0                                 #language en-US "PEB0 Cap"
#string STR_IOE_CAP_PEB1                                 #language en-US "PEB1 Cap"
#string STR_IOE_DNPORT_CTRL                                 #language en-US "DN Port Control"
#string STR_IOE_DNPORT_CTRL_HELP                                #language en-US "Skip some code for specific DN ports"
#string STR_IOE_PEA0_CTRL                                 #language en-US "PEA0 Control"
#string STR_IOE_PEA1_CTRL                                 #language en-US "PEA1 Control"
#string STR_IOE_PEA2_CTRL                                 #language en-US "PEA2 Control"
#string STR_IOE_PEA3_CTRL                                 #language en-US "PEA3 Control"
#string STR_IOE_PEA4_CTRL                                 #language en-US "PEA4 Control"
#string STR_IOE_PEB0_CTRL                                 #language en-US "PEB0 Control"
#string STR_IOE_PEB1_CTRL                                 #language en-US "PEB1 Control"
#string STR_IOE_TOP_FORM                       #language en-US "IOE TOP Setup"
#string STR_IOE_TOP_FORM_HELP                  #language en-US "IOE TOP Setup"                                           
#string STR_IOE_MODE_SEL                       #language en-US "Mode Select"
#string STR_BIOS_MODE                  #language en-US "BIOS mode"
#string STR_DISABLED                       #language en-US "Disabled"
#string STR_ENABLED                       #language en-US "Enabled"
#string STR_SPI_MODE                                #language en-US "SPI mode"
#string STR_IOE_HIDE_XB_CTRL                                #language en-US "Cnd003HideXbctl" 
#string STR_IOE_HIDE_EPTRFC                                #language en-US "Cnd003HideEptrfc"
 
#string STR_8051_UART_ENABLED                                #language en-US "8051 Own UART"    
#string STR_XHCI_UART_ENABLED                                #language en-US "XHCI Own UART"   
#ifdef ZX_SECRET_CODE
 #string STR_IOE_CHOOSE_DIDVID                                #language en-US "DIDVID Choose" 
#string  STR_VIA          #language en-US "VIA"
 #string  STR_ZX          #language en-US "VAS"
#endif
#string STR_IOE_TCXFAVOR                                #language en-US "Cnd003TCxFavor"  
#string STR_IOE_DEBUG_SIGNAL_FORM                                #language en-US "IOE Debug Signal Selection"    
#string STR_IOE_CLK_SRCL_FORM                                #language en-US "IOE CLK SRC"    
#string STR_IOE_PLL_PCIEASSC_EN                                #language en-US "PLLPCIEA SSC Enable"    
#string STR_IOE_PLL_PCIEASSC_EN_HELP                                #language en-US "PLLPCIEA SSC Enable"    
#string STR_IOE_PLL_PCIEASSC_MAGNITUDE                                #language en-US "PLLPCIEA SSC Magnitude"    
#string STR_IOE_PLL_PCIEASSC_MAGNITUDE_HELP                                #language en-US "PLLPCIEA SSC Magnitude"    
#string  STR_0_15          #language en-US "0.15%"
#string  STR_0_20          #language en-US "0.20%"
#string  STR_0_25          #language en-US "0.25%"
#string  STR_0_30          #language en-US "0.30%"
#string  STR_0_35          #language en-US "0.35%"
#string  STR_0_40          #language en-US "0.40%"
#string  STR_0_45          #language en-US "0.45%"
#string  STR_0_50          #language en-US "0.50%"
#string  STR_IOE_PLL_PCIEASSC_SPREAD          #language en-US "CKGSRC PLLPCIEA SSC Spread Mode"
#string  STR_IOE_PLL_PCIEASSC_SPREAD_HELP          #language en-US "CKGSRC PLLPCIEA SSC Spread Mode"
#string  STR_DOWN_SPREAD          #language en-US "Down spread"
#string  STR_CENTRAL_SPREAD          #language en-US "Central spread"
#string  STR_IOE_PLL_PCIEBSSC_EN          #language en-US "PLLPCIEB SSC Enable"
#string  STR_IOE_PLL_PCIEBSSC_EN_HELP          #language en-US "PLLPCIEB SSC Enable"
#string  STR_IOE_PLL_PCIEBSSC_MAGNITUDE          #language en-US "PLLPCIEB SSC Magnitude"
#string  STR_IOE_PLL_PCIEBSSC_MAGNITUDE_HELP          #language en-US "PLLPCIEB SSC Magnitude"
#string  STR_IOE_PLL_PCIEBSSC_SPREAD          #language en-US "CKGSRC PLLPCIEB SSC Spread Mode"
#string  STR_IOE_PLL_PCIEBSSC_SPREAD_HELP          #language en-US "CKGSRC PLLPCIEB SSC Spread Mode"
#string  STR_IOE_USB_CLK_SEL          #language en-US "USB Clock Selection"
#string  STR_IOE_USB_CLK_SEL_HELP          #language en-US "USB Clock Selection"
#string  STR_PLLA          #language en-US "PLLA"
#string  STR_PLLB          #language en-US "PLLB"
#string  STR_IOE_SATA_CLK_SEL          #language en-US "SATA Clock Selection"
#string  STR_IOE_SATA_CLK_SEL_HELP          #language en-US "SATA Clock Selection"
#string STR_IOE_DEBUG_FROM_CPU                                #language en-US "DBG Sel"                                       
#string STR_DISBALE                                #language en-US "Disable"                                       
#string STR_MMIO                                #language en-US "MMIO"                                       
#string STR_SMBUS                                #language en-US "SMBUS"    
#string STR_IOE_MODULE_G0                                #language en-US "Module G0" 
#string STR_CLOCK_COUNTER                                #language en-US "Clock Counter" 
#string STR_PCIEIF                               #language en-US "PCIEIF" 
#string STR_EPTRFC                                #language en-US "EPTRFC"  
#string STR_ISB_BUSXD0F0_CORE                                #language en-US "ISB_BUSXD0F0_CORE" 
#string STR_DBGMCU                                #language en-US "DBGMCU"                                    
#string STR_SATA                                #language en-US "SATA" 
#string STR_USBC_CORE_D14                                #language en-US "USBC_CORE_D14" 
#string STR_USBC_CORE_D16                                #language en-US "USBC_CORE_D16" 
#string STR_GNIC                                #language en-US "GNIC" 
#string STR_TOP                                #language en-US "TOP" 
#string STR_ISB_SUS                                #language en-US "ISB_SUS" 
#string STR_INTMAP                                #language en-US "INTMAP" 
#string STR_DBGCAP                                #language en-US "DBGCAP" 
#string STR_ISB_XHCI                                #language en-US "ISB_XHCI" 
#string STR_PCIE                                #language en-US "PCIE" 
#string STR_IOE_MODULE_G1                                #language en-US "Module G1" 
#string STR_IOE_DEBUG_G0                                #language en-US "G0" 
#string STR_IOE_DEBUG_G1                                #language en-US "G1"
#string STR_IOE_DEBUG_G2                                #language en-US "G2"
#string STR_IOE_DEBUG_G3                                #language en-US "G3"
#string STR_IOE_DEBUG_G0_XHCI                                #language en-US "ISB XHCI G0" 
#string STR_IOE_DEBUG_G1_XHCI                                #language en-US "ISB XHCI G1"
#string STR_IOE_DEBUG_G2_XHCI                                #language en-US "ISB XHCI G2"
#string STR_IOE_DEBUG_G3_XHCI                                #language en-US "ISB XHCI G3"
#string STR_IOE_DEBUG_SUS                                #language en-US "Suspend Module Sel"
#string STR_CLOCK_COUNTER                                #language en-US "Clock Counter"
#string STR_SPI                                #language en-US "SPI"
#string STR_SPIARB                                #language en-US "SPIARB"
#string STR_SMB                                #language en-US "SMB  "
#string STR_PCIEIF_SUS                                #language en-US "PCIEIF_SUS"
#string STR_ISB_BUSXD0F0_SUS                                #language en-US "ISB_BUSXD0F0_SUS"
#string STR_TOPPMU                                #language en-US "TOPPMU"
#string STR_USBC_SUS_D14                                #language en-US "USBC_SUS_D14"
#string STR_USBC_SUS_D16                                #language en-US "USBC_SUS_D16"
#string STR_GNIC_SUS                                #language en-US "GNIC_SUS"
#string STR_EFUSE                                #language en-US "EFUSE"                                       
#string STR_TOP                                #language en-US "TOP"                                       
#string STR_IOE_HIGHSPEED                                #language en-US "High Speed"                                       
#string STR_IOE_HIGHSPEED_MODULE_SEL                                #language en-US "High Speed Module Sel"                                       
#string STR_CLOCK_COUNTER                                #language en-US "Clock Counter"                                       
#string STR_PCIEIF                                #language en-US "PCIEIF"                                       
#string STR_EPTRFC                                #language en-US "EPTRFC"                                       
#string STR_ISB_BUSXD0F0_CORE                                #language en-US "ISB_BUSXD0F0_CORE"                                       
#string STR_DBGMCU                                #language en-US "DBGMCU"                                       
#string STR_SATA                                #language en-US "SATA"                                       
#string STR_D14_USBC                                #language en-US "D14_USBC"                                       
#string STR_D16_USBC                                #language en-US "D16_USBC"                                       
#string STR_GNIC                                #language en-US "GNIC"                                       
#string STR_DBGCAP                                #language en-US "DBGCAP"                                       
#string STR_XHCI                                #language en-US "XHCI"                                       
#string STR_PCIE                                #language en-US "PCIE"                                       
#string STR_IOE_HIGHSPEED_DBG_SEL                                #language en-US "High Speed Debug Signal"         
#string STR_IOE_SATA_FORM                      #language en-US "IOE SATA Drive Setup"
#string STR_IOE_SATA_FORM_HELP                 #language en-US "Select this option to configure your system's IOE SATA drive."
#string STR_IOE_SATA_FORM                      #language en-US "IOE SATA Drive Setup"
#string STR_IOE_USB_FORM                       #language en-US "IOE USB Drive Setup"
#string STR_IOE_SATA_CONTROLLER_HELP           #language en-US "Select whether to enable or disable SATA controller."
#string STR_IOE_SATA_CONTROLLER            #language en-US "CND003 SATA Controller"
#string  STR_IDE          #language en-US "IDE"
#string  STR_RAID          #language en-US "RAID"
#string  STR_AHCI          #language en-US "AHCI"
#string  STR_AHCI_EN         #language en-US "RAID Function Select"
#string  STR_AHCI_EN_HELP          #language en-US "RAID function to work in IDE mode or AHCI mode"
#string  STR_IDE_MODE          #language en-US "IDE Mode"
#string  STR_AHCI_MODE1          #language en-US "AHCI Mode"
#string  STR_SATA_CAP_PORT0         #language en-US "Chipset SATA Driver Cap All Port"
#string  STR_SATA_CAP_PORT0_HELP         #language en-US "SATA Port Capability flag for SATA driver"
#string  STR_HOTPLUG         #language en-US "Hot-Plug"
#string  STR_LINKPM          #language en-US "Link PM"
#string  STR_SATA_HIPM_PORT0          #language en-US "HIPM function All Port"
#string  STR_SATA_HIPM_PORT0_HELP          #language en-US "SATA HIPM function control"
#string  STR_DISABLED          #language en-US "Disabled"
#string  STR_ENABLED          #language en-US "Enabled"
#string  STR_SATA_PORT0_HPCP_EN          #language en-US "AHCI Port Hot-Plug Cap"
#string  STR_SATA_PORT0_HPCP_EN_HELP          #language en-US "Enable AHCI Hot-Plug Capability for Port0"
#string  STR_SUND_WAIT_TIME_HELP          #language en-US "Enable DIPM for All Port in BIOS"
#string  STR_SUND_WAIT_TIME          #language en-US "RAID Viewer Auto Exit Waiting Time"
#string  STR_SUND_WAIT_TIME_HELP          #language en-US "Time in seconds to wait before auto exiting  StorX RAID Viewer when RAID is abnormal. 0-255, 0 sec means waiting until exit key is pressed."
#string  STR_DISABLE          #language en-US "Disable"
#string  STR_SATA_FUNC_LEV_EN          #language en-US "Function Level Reset Enabled"
#string  STR_SATA_FUNC_LEV_EN_HELP          #language en-US "Enable Function Level Reset in BIOS"
#string  STR_SATA_GEN          #language en-US "Force SATA Speed setting"
#string  STR_GEN_HELP          #language en-US "Gen1/Gen2/Gen3"
#string  STR_GEN1          #language en-US "Gen1"
#string  STR_GEN2          #language en-US "Gen2"
#string  STR_GEN3          #language en-US "Gen3"
#string  STR_AHCI_GEN           #language en-US "Force SATA Speed setting"
#string  STR_AHCI_MSI           #language en-US "Support MSI"
#string  STR_AHCI_MSI_HELP      #language en-US "Enable MSI in BIOS"
#string  STR_AHCI_MSIX          #language en-US "Support MSI-X"
#string  STR_AHCI_MSIX_HELP     #language en-US "Enable MSI-X in BIOS"
#string STR_SATA_DRIVE0_NAME               #language en-US "SATA Drive 0"
#string STR_SATA_DRIVE0_VALUE              #language en-US "Not Present"
#string STR_SATA_DRIVE1_NAME               #language en-US "SATA Drive 1"
#string STR_SATA_DRIVE1_VALUE              #language en-US "Not Present"
#string STR_SATA_DRIVE2_NAME               #language en-US "SATA Drive 2"
#string STR_SATA_DRIVE2_VALUE              #language en-US "Not Present"
#string STR_SATA_DRIVE3_NAME               #language en-US "SATA Drive 3"
#string STR_SATA_DRIVE3_VALUE              #language en-US "Not Present"
#string STR_COM_EMPTY                      #language en-US ""
#string STR_USB_FORM                       #language en-US "IOE Usb Setup"
#string STR_USB_FORM_HELP                  #language en-US "IOE Usb Setup"    
#string STR_IOE_USB_MODE_SEL_MODE                       #language en-US "Usb Mode Select Method"
#string STR_IOE_USB_MODE_SEL_MODE_HELP                  #language en-US "Usb Mode Select Method: auto by soc chip revision or manu by user"
#string STR_IOE_USB_MODE_SEL_AUTO          #language en-US "AUTO"
#string STR_IOE_USB_MODE_SEL_MANU          #language en-US "MANU"
#string STR_IOE_USB_MODE                       #language en-US "Usb Mode Select"
#string STR_IOE_USB_MODE_HELP                  #language en-US "Mode1:EHCI only mode       Mode2:EHCI and SSBI/SSPBI mode  Mode4:EHCI and xHCI Separate mode"
#string STR_IOE_USB_DISABLED                       #language en-US "Disabled"
#string STR_IOE_USB_MODE1                          #language en-US "IOE Mode 1"
#string STR_IOE_USB_MODE2                          #language en-US "IOE Mode 2"                     
#string STR_IOE_USB_MODE3                          #language en-US "IOE Mode 3"
#string STR_IOE_USB_MODE4                          #language en-US "IOE Mode 4"
#string STR_DISABLE                           #language en-US "Disable"
#string STR_IOE_TRB_CACHE                               #language en-US "TRB Cache Bypass Mode"
#string STR_IOE_TRB_CACHE_HELP                           #language en-US "TRB Cache/Stream Context Cache Bypass Mode select"
 
#string STR_IOE_XHCI_OUTBURST_EN                               #language en-US "Enable/Disable OUT Bursting"
#string STR_IOE_XHCI_OUTBURST_EN_HELP                           #language en-US "Enable/Disable OUT Bursting"
#string STR_IOE_XHCI_MAXBURST_EN                               #language en-US "MaxBurstSize=0xFF Mult=0x3 Enable/Disable for SS(P) Bulk"
#string STR_IOE_XHCI_MAXBURST_EN_HELP                           #language en-US "MaxBurstSize=0xFF Mult=0x3 Enable/Disable for SS(P) Bulk"
#string STR_NOT_BYPASS                      #language en-US "Not Bypass"
#string STR_BYPASS                              #language en-US "Bypass"
#string STR_IOE_USBC_FLRSUP                      #language en-US "USBC FLR Support"
#string STR_IOE_USBC_FLRSUP_HELP                              #language en-US "USBC FLR Enable/Disable select"
#string STR_DISABLED                                #language en-US "Dosabled"
#string STR_ENABLED                               #language en-US "Enabled"
#string STR_IOE_XHCI_FLRSUP                           #language en-US "XHCI FLR Support"
#string STR_IOE_XHCI_FLRSUP_HELP                      #language en-US "XHCI FLR Enable/Disable select"
#string STR_IOE_RTD3_CONTROL                           #language en-US "RTD3 Support"
#string STR_IOE_RTD3_CONTROL_HELP                           #language en-US "RTD3 Enable/Disable select"
#string STR_IOE_USB_S4WAKEUP                      #language en-US "USB S4 WakeUp"
#string STR_IOE_USB_S4WAKEUP_HELP                      #language en-US "USB S4 Wake Up"   
#string STR_IOE_USB_C4BLOCK                     #language en-US "USB Block C4"
#string STR_IOE_USB_C4BLOCK_HELP                      #language en-US "USB Block C4 when iso transfer"   
#string STR_IOE_USB_10G_SUPP                      #language en-US "IOE Usb Port4/5 10G Support"
#string STR_IOE_USB_10G_SUPP_HELP                      #language en-US "IOE Usb Port4/5 10G Support"   
#string STR_IOE_USB_EITRN                      #language en-US "IOE Usb Electrical Idle Triggered Retrain Enable/Disable"
#string STR_IOE_USB_EITRN_HELP                      #language en-US "IOE Usb Electrical Idle Triggered Retrain Enable/Disable" 
#string STR_IOE_USB_OCEN                      #language en-US "IOE Usb OC Enable"
#string STR_IOE_USB_OCEN_HELP                      #language en-US "IOE Usb OC Enable"  
#string STR_SWITCH_HUB_FW                           #language en-US "Switch Hub Fw"
#string STR_SWITCH_HUB_FW_DISABLE                      #language en-US "Disable Hub Fw Squelch Patch"
#string STR_SWITCH_HUB_FW_ENABLE                      #language en-US "Enable Hub Fw Squelch Patch"  
#string STR_LEGACY_USB_EN                             #language en-US "Legacy Usb Support"
#string STR_LEGACY_USB_EN_HELP                        #language en-US "Legacy Usb Support"
#string STR_IOE_GNIC_FORM                       #language en-US "IOE GNIC Setup"
#string STR_IOE_GNIC_FORM_HELP                  #language en-US "IOE GNIC Setup"                                           
#string STR_IOE_GNIC_EN                       #language en-US "GNIC Enable/Disable"
#string STR_IOE_GNIC_EN_HELP                  #language en-US "GNIC Function Enable Control"
#string STR_DISABLED                       #language en-US "Disabled"
#string STR_ENABLED                       #language en-US "Enabled"
#string STR_IOE_GNIC_TXDCS                              #language en-US "TX Delay Comp Selection "
#string STR_IOE_GNIC_TXDCS_HELP                                #language en-US "TX Delay Comp Selection"
#string STR_NO_DELAY                               #language en-US "No Delay"
#string STR_DE0                                #language en-US "DE0"
#string STR_DE01                                #language en-US "DE01" 
#string STR_DE012                                #language en-US "DE012"
#string STR_4NS                                #language en-US "4ns"  
#string STR_4NS_DE0                                #language en-US "4ns+DE0"    
#string STR_4NS_DE01                                #language en-US "4ns+DE01"                                       
#string STR_4NS_DE012                                #language en-US "4ns+DE012"                                       
#string STR_IOE_GNIC_TXDC0                                #language en-US "TX Delay Counter0"                                       
#string STR_IOE_GNIC_TXDC0_HELP                                #language en-US "TX Delay Counter0"                                       
#string STR_IOE_GNIC_TXDC1                                #language en-US "TX Delay Counter1" 
#string STR_IOE_GNIC_TXDC1_HELP                                #language en-US "TX Delay Counter1"  
#string STR_IOE_GNIC_TXDC2                               #language en-US "TX Delay Counter2" 
#string STR_IOE_GNIC_TXDC2_HELP                                #language en-US "TX Delay Counter2"  
#string STR_IOE_GNIC_RXDCS                                #language en-US "RX Delay Comp Selection" 
#string STR_IOE_GNIC_TXDCS_HELP                                #language en-US "RX Delay Comp Selection"                                    
#string STR_IOE_GNIC_RXDC0                                #language en-US "RX Delay Counter0" 
#string STR_IOE_GNIC_RXDC0_HELP                                #language en-US "RX Delay Counter0" 
#string STR_IOE_GNIC_RXDC1                                #language en-US "RX Delay Counter1" 
#string STR_IOE_GNIC_RXDC1_HELP                                #language en-US "RX Delay Counter1" 
#string STR_IOE_GNIC_RXDC2                                #language en-US "RX Delay Counter2" 
#string STR_IOE_GNIC_RXDC2_HELP                                #language en-US "RX Delay Counter2" 
#string STR_IOE_GNIC_DPDC64                                #language en-US "Data Path Delay Control 64B" 
#string STR_IOE_GNIC_DPDC64_HELP                                #language en-US "TX Latency when TF FIFO remains 64Bytes" 
#string STR_IOE_GNIC_DPDC128                                #language en-US "Data Path Delay Control 128B" 
#string STR_IOE_GNIC_DPDC128_HELP                                #language en-US "TX Latency when TF FIFO remains 128Bytes" 
#string STR_IOE_GNIC_DPDC256                                #language en-US "Data Path Delay Control 256B" 
#string STR_IOE_GNIC_DPDC256_HELP                                #language en-US "TX Latency when TF FIFO remains 256Bytes" 
#string STR_IOE_GNIC_FORCESIZE_EN                                #language en-US "MAX Payload/RD req Size control"
#string STR_IOE_GNIC_FORCESIZE_EN_HELP                                #language en-US "MAX Payload/RD req Size control"
#string STR_DEFAULT                                #language en-US "Default"
#string STR_FORCE_CTRL                                #language en-US "Force  Control"
#string STR_IOE_GNIC_FORCE_RDR                                #language en-US "RD request Size control"
#string STR_IOE_GNIC_FORCE_RDR_HELP                                #language en-US "RD request Size control"
#string STR_128_BYTE                                #language en-US "128 Bytes"
#string STR_256_BYTE                                #language en-US "256 Bytes"
#string STR_IOE_GNIC_FORCE_PAYLOAD                                #language en-US "Payload Size control"
#string STR_IOE_GNIC_FORCE_PAYLOAD_HELP                                #language en-US "Payload Size control"
#string STR_IOE_GNIC_EVENT_CTRL                                #language en-US "MSI One Event One Request"
#string STR_IOE_GNIC_EVENT_CTRL_HELP                                #language en-US "MSI One Event One Request Control"
#string STR_IOE_GNIC_PENDING_CTRL                                #language en-US "MSI Pending clear after sending"
#string STR_IOE_GNIC_PENDING_CTRL_HELP                                #language en-US "MSI Pending clear after sending"
#string STR_IOE_GNIC_MSI_CTRL                                  #language en-US "MSI Control"
#string STR_IOE_GNIC_MSI_CTRL_HELP                             #language en-US "MSI Control"
#string STR_IOE_GNIC_MSIX_CTRL                                 #language en-US "MSI-X Control"
#string STR_IOE_GNIC_MSIX_CTRL_HELP                            #language en-US "MSI-X Control"
#string STR_IOE_GNIC_D0PME_CTRL                                #language en-US "D0 PME Support"
#string STR_IOE_GNIC_D0PME_CTRL_HELP                           #language en-US "D0 PME Support"
#string STR_IOE_GNIC_VEEPROMEN				#language en-US "Virtual EEPROM Support"
#string STR_IOE_GNIC_VEEPROMEN_HELP			#language en-US "Virtual EEPROM Support"
#string STR_IOE_SPE_FORM								 #language en-US "IOE SPE Value Setting"





#string STR_SATA_FORM                      #language en-US "ATA Drive Setup"
                                           #language zh-Hans "ATA \wide设备菜单\narrow"
#string STR_SATA_FORM_HELP                 #language en-US "Select this option to configure your system's ATA drive."
                                           #language zh-Hans "\wide选择此选项可配置系统的\narrowATA\wide驱动器.\narrow"
#string STR_SATA_CONTROLLER                #language en-US "CND001 SATA Controller"
                                           #language zh-Hans "CND001 SATA \wide控制器\narrow"
#string STR_IOE_SATA_CONTROLLER            #language en-US "CND003 SATA Controller"
                                           #language zh-Hans "CND003 SATA \wide控制器\narrow"
#string STR_SATA_CONTROLLER_HELP           #language en-US "Select whether to enable or disable SATA controller."
                                           #language zh-Hans "\wide选择是否支持\narrowSATA\wide设备。\narrow"
#string STR_SATA_DRIVE1                    #language en-US "SATA Drive 1"
                                           #language zh-Hans "SATA \wide驱动器\narrow1"
#string STR_SATA_DRIVE1_HELP               #language en-US "Select whether to enable or disable SATA drive 1."
                                           #language zh-Hans "\wide选择是否打开\narrowSATA\wide驱动器1。\narrow"
#string STR_SATA_DRIVE2                    #language en-US "SATA Drive 2"
                                           #language zh-Hans "SATA \wide驱动器\narrow2"
#string STR_SATA_DRIVE2_HELP               #language en-US "Select whether to enable or disable SATA drive 2."
                                           #language zh-Hans "\wide选择是否打开\narrowSATA\wide驱动器2。\narrow"
#string STR_SATA_MODE                      #language en-US "Configure SATA as"
                                           #language zh-Hans "\wide配置\narrowSATA\wide 为\narrow"
#string STR_SATA_MODE_HELP                 #language en-US "Select IDE/AHCI Mode. NOTE: Device driver support is required  for AHCI. Depending on how the hard disk image was installed, changing this setting may prevent the system from booting."
                                           #language zh-Hans "\wide选择\narrowIDE\wide或\narrowAHCI\wide模式。 \n注意：设备驱动支持\narrowAHCI\wide或者\narrowRAID\wide模式取决于硬盘如何安装。改变这个设定可能引起无法从系统启动。\narrow"
#string STR_SATA_MODE_IDE                  #language en-US "IDE"
                                           #language zh-Hans "IDE"
#string STR_SATA_MODE_RAID                 #language en-US "RAID"
                                           #language zh-Hans "RAID"
#string STR_SATA_MODE_AHCI                 #language en-US "AHCI"
                                           #language zh-Hans "AHCI"
#string STR_SATA_MODE_OPERATION            #language en-US "Native Mode Operation"
                                           #language zh-Hans "\wide  Native模式工作\narrow"
#string STR_SATA_MODE_OPERATION_HELP       #language en-US "Choose native mode for ATA. NOTE: Certain OS is not supported under native mode."
                                           #language zh-Hans "\wide配置\narrowATA\wide设备为\narrownative\wide模式工作。 注意: 某些操作系统不支持在\narrownative\wide模式工作。\narrow"
#string STR_HARD_DISK_PRE_DELAY            #language en-US "Hard Disk Pre-delay"
                                           #language zh-Hans "\wide硬盘预延迟\narrow"
#string STR_HARD_DISK_PRE_DELAY_HELP       #language en-US "Adds a delay before the first access of a hard disk by the system software. Some hard disks hang if accessed before they have initialized themselves. This delay ensures the hard disk has initialized after power up, prior to being accessed."
                                           #language zh-Hans "\wide在软件访问硬盘时添加延迟，有些硬盘在没有完全初始化完毕时访问会死机，这个延迟保证硬盘在开机完全被初始化后被访问。\narrow"
#string STR_DELAY_3SECONDES                #language en-US "3 Seconds"
                                           #language zh-Hans "\wide3 秒\narrow"
#string STR_DELAY_6SECONDES                #language en-US "6 Seconds"
                                           #language zh-Hans "\wide6 秒\narrow"
#string STR_DELAY_9SECONDES                #language en-US "9 Seconds"
                                           #language zh-Hans "\wide9 秒\narrow"
#string STR_DELAY_12SECONDES               #language en-US "12 Seconds"
                                           #language zh-Hans "\wide12 秒\narrow"
#string STR_DELAY_15SECONDES               #language en-US "15 Seconds"
                                           #language zh-Hans "\wide15 秒\narrow"
#string STR_DELAY_21SECONDES               #language en-US "21 Seconds"
                                           #language zh-Hans "\wide21 秒\narrow"
#string STR_DELAY_30SECONDES               #language en-US "30 Seconds"
                                           #language zh-Hans "\wide30 秒\narrow"

#string STR_SATA_CHANNEL_MODE              #language en-US "Channel Operating Mode"
                                           #language zh-Hans "Channel Operating Mode"
#string STR_SATA_CHANNEL_MODE_HELP         #language en-US "Compatibility: Resource and IRQ is fixed for SATA device; Native PCI: Resource and IRQ is assigned by BIOS."
                                           #language zh-Hans "Compatibility: Resource and IRQ is fixed for SATA device; Native PCI: Resource and IRQ is assigned by BIOS."
#string STR_SATA_CHANNEL_MODE_0            #language en-US "Compatibility"
                                           #language zh-Hans "Compatibility"
#string STR_SATA_CHANNEL_MODE_1            #language en-US "Native PCI"
                                           #language zh-Hans "Native PCI"
#string STR_SATA_ODD                       #language en-US "Force HIPM/DIPM Disabled for ODD"
                                           #language zh-Hans "Force HIPM/DIPM Disabled for ODD"
#string STR_SATA_ODD_HELP                  #language en-US "Enabled: enable this feature will force SATA port with ODD device (or no device) to support Hot Plug only In otherwords, ODD will not enter power mode no matter user has enabled HIPM/DIPM or not; Disabled: disable this feature will let user to enable/disable HIPM/DIPM by BIOS item."
                                           #language zh-Hans "Enabled: enable this feature will force SATA port with ODD device (or no device) to support Hot Plug only In otherwords, ODD will not enter power mode no matter user has enabled HIPM/DIPM or not; Disabled: disable this feature will let user to enable/disable HIPM/DIPM by BIOS item."
#string STR_SATA_PMP                       #language en-US "Support PMP during BIOS POST"
                                           #language zh-Hans "Support PMP during BIOS POST"
#string STR_SATA_PMP_HELP                  #language en-US "Support PMP during BIOS POST"
                                           #language zh-Hans "Support PMP during BIOS POST"
#string STR_PORT1_ESATA                    #language en-US "eSATA Support for Port1"
                                           #language zh-Hans "eSATA Support for Port1"
#string STR_PORT1_ESATA_HELP               #language en-US "Enabled: eSATA cable Driving in port1; Disabled: Normal cable Driving in port1."
                                           #language zh-Hans "Enabled: eSATA cable Driving in port1; Disabled: Normal cable Driving in port1."
#string STR_SATA_LINUX_PATCH               #language en-US "Linux SATA Patch"
                                           #language zh-Hans "Linux SATA Patch"
#string STR_SATA_LINUX_PATCH_HELP          #language en-US "Linux SATA Patch"
                                           #language zh-Hans "Linux SATA Patch"
#string STR_SATA_ASYNC_RECOVERY            #language en-US "Continuous Async Recovery"
                                           #language zh-Hans "Continuous Async Recovery"
#string STR_SATA_ASYNC_RECOVERY_HELP       #language en-US "Limit Continuous Asynchronous Recovery to five times only for IDE and RAID."
                                           #language zh-Hans "Limit Continuous Asynchronous Recovery to five times only for IDE and RAID."
#string STR_SATA_ASYNC_RECOVERY_0          #language en-US "NoLimit"
                                           #language zh-Hans "NoLimit"
#string STR_SATA_ASYNC_RECOVERY_1          #language en-US "LimitToFive"
                                           #language zh-Hans "LimitToFive"
#string STR_SB_OTHERS_FORM                 #language en-US "Others Configuration"
                                           #language zh-Hans "Others Configuration"
#string STR_SB_OTHERS_FORM_HELP            #language en-US "Others Configuration Parameters"
                                           #language zh-Hans "Others Configuration Parameters"
#string STR_SATA_RAID_FUNCTION             #language en-US "RAID Function Select"
                                           #language zh-Hans "RAID Function Select"
#string STR_SATA_RAID_FUNCTION_HELP        #language en-US "AHCI Mode: RAID function to work in AHCI mode; IDE Mode: RAID function to work in IDE mode."
                                           #language zh-Hans "AHCI Mode: RAID function to work in AHCI mode; IDE Mode: RAID function to work in IDE mode."
#string STR_SATA_RAID_FUNCTION_0           #language en-US "IDE Mode"
                                           #language zh-Hans "IDE Mode"
#string STR_SATA_RAID_FUNCTION_1           #language en-US "AHCI Mode"
                                           #language zh-Hans "AHCI Mode"
#string STR_SATA_RAID_VIEWER_EXIT          #language en-US "RAID Viewer Auto Exit Waiting Time"
                                           #language zh-Hans "RAID Viewer Auto Exit Waiting Time"
#string STR_SATA_RAID_VIEWER_EXIT_HELP     #language en-US "Time in seconds to wait before auto exiting  StorX RAID Viewer when RAID is abnormal."
                                           #language zh-Hans "Time in seconds to wait before auto exiting  StorX RAID Viewer when RAID is abnormal."
#string STR_ACHI_HOT_PLUG_PORT0            #language en-US "ACHI Port0 Hot-Plug Cap"
                                           #language zh-Hans "ACHI Port0 Hot-Plug Cap"
#string STR_ACHI_HOT_PLUG_PORT0_HELP       #language en-US "Enable AHCI Hot-Plug Capability for Port0."
                                           #language zh-Hans "Enable AHCI Hot-Plug Capability for Port0."
#string STR_ACHI_HOT_PLUG_PORT1            #language en-US "ACHI Port1 Hot-Plug Cap"
                                           #language zh-Hans "ACHI Port1 Hot-Plug Cap"
#string STR_ACHI_HOT_PLUG_PORT1_HELP       #language en-US "Enable AHCI Hot-Plug Capability for Port1."
                                           #language zh-Hans "Enable AHCI Hot-Plug Capability for Port1."
#string STR_ACHI_HOT_PLUG_PATCH            #language en-US "AHCI Hot Plug-out Patch"
                                           #language zh-Hans "AHCI Hot Plug-out Patch"
#string STR_ACHI_HOT_PLUG_PATCH_HELP       #language en-US "In AHCI mode, Hot Plug-Out Patch to use GP3 timer auto refresh for VT3456A0/A1."
                                           #language zh-Hans "In AHCI mode, Hot Plug-Out Patch to use GP3 timer auto refresh for VT3456A0/A1."
#string STR_ACHI_HIPM_TIMER                #language en-US "Support AHCI HIPM shortest Timer"
                                           #language zh-Hans "Support AHCI HIPM shortest Timer"
#string STR_ACHI_HIPM_TIMER_HELP           #language en-US "Support AHCI HIPM shortest Timer"
                                           #language zh-Hans "Support AHCI HIPM shortest Timer"
#string STR_ACHI_HIPM_TIMER_0              #language en-US "Shortest"
                                           #language zh-Hans "Shortest"
#string STR_ACHI_HIPM_PATCH                #language en-US "Patch HIPM for AHCI Power Mode"
                                           #language zh-Hans "Patch HIPM for AHCI Power Mode"
#string STR_ACHI_HIPM_PATCH_HELP           #language en-US "In some SATA Device, system will random hang during S3 resume in AHCI power mode, So BIOS can offer patch code for AHCI power mode after S3 resume."
                                           #language zh-Hans "In some SATA Device, system will random hang during S3 resume in AHCI power mode, So BIOS can offer patch code for AHCI power mode after S3 resume."

#string STR_IOE_SATA_MODE                  #language en-US "Configure IOE SATA as"
#string STR_IOE_SATA_GEN                   #language en-US "Force IOE SATA Speed Setting"
#string STR_IOE_AHCI_GEN                   #language en-US "Force IOE SATA Speed Setting"
#string STR_IOE_AHCI_MSI                   #language en-US "IOE SATA Support MSI"
#string STR_IOE_AHCI_MSIX                  #language en-US "IOE SATA Support MSIX"
#string STR_IOE_SATA_FUNC_LEV_EN           #language en-US "IOE Function Level Reset Enabled"
                                                                                     
#string STR_SATA_CFG           #language en-US "SATA Mode"
#string STR_SATA_CFG_HELP           #language en-US "SATA Configure"
#string  STR_IDE          #language en-US "IDE"
#string  STR_RAID          #language en-US "RAID"
#string  STR_AHCI          #language en-US "AHCI"
#string  STR_SATA_CHANNEL_MODE          #language en-US "Channel Operating Mode"
#string  STR_SATA_CHANNEL_MODE_HELP          #language en-US "Compibility:Resource and IRQ is fixed for SATA device;Native PCI: Resource and IRQ is assigned by BIOS"
#string  STR_COMPILITY          #language en-US "Compatibility"
#string  STR_NATIVE          #language en-US "Native PCI"
#string  STR_AHCI_EN         #language en-US "RAID Function Select"
#string  STR_AHCI_EN_HELP          #language en-US "AHCI mode:RAID function to work in AHCI mode                                                IDE mode: RAID function to work in IDE mode"
#string  STR_IDE_MODE          #language en-US "IDE Mode"
#string  STR_AHCI_MODE         #language en-US "AHCI Mode"
#string  STR_SATA_CAP_SELECT         #language en-US "IDE All Port Driver Cap Select"
#string  STR_SATA_CAP_SELECT_HELP         #language en-US "IDE Port Capability flag for SATA driver;"
#string  STR_HOTPLUG         #language en-US "Hot-Plug"
#string  STR_LINKPM          #language en-US "Link PM"
#string  STR_SATA_HIPM_EN          #language en-US "HIPM function All Port"
#string  STR_SATA_HIPM_EN_HELP          #language en-US "SATA HIPM function control;"
#string  STR_DISABLED          #language en-US "Disabled"
#string  STR_ENABLED          #language en-US "Enabled"
#string  STR_SATA_HPCP_EN          #language en-US "AHCI Port HotPlug Cap"
#string  STR_SATA_HPCP_EN_HELP     #language en-US "Enable AHCI Hot-Plug Capability for All Port"

#string  STR_SATA_ALPM_EN          #language en-US "AHCI Link Power Management"
#string  STR_SATA_ALPM_EN_HELP     #language en-US "Enable AHCI Aggressive Link Power Management for All Port"

#string  STR_SATA_PORT0_DIPM_EN          #language en-US "All Port DIPM Enable in BIOS"
#string  STR_SATA_PORT0_DIPM_EN_HELP          #language en-US "Enable DIPM for All Port in BIOS"

#string  STR_SUND_WAIT_TIME          #language en-US "RAID Viewer Auto Exit Waiting Time"
#string  STR_SUND_WAIT_TIME_HELP          #language en-US "Time in seconds to wait before auto exiting  StorX RAID Viewer when RAID is abnormal. 0-255, 0 sec means waiting until exit key is pressed."


#string   STR_SUP_HIPMTIMER         #language en-US "Support AHCI HIPM shortest Timer"
#string  STR_SUP_HIPMTIMER_HELP          #language en-US "Support AHCI HIPM shortest Timer select"
#string  STR_DISABLE          #language en-US "Disable"
#string  STR_SHORTEST          #language en-US "Shortest"
#string  STR_NORMAL         #language en-US "Normal"
#string  STR_SATA_ASYN_RECOVERY          #language en-US "Continuous Async Recovery"
#string  STR_SATA_ASYN_RECOVERY_HELP          #language en-US "Limit Continuous Asynchronous Recovery to Five Times Only for IDE and RAID"
#string  STR_NO_LIMIT          #language en-US "No Limit"
#string  STR_LINIT_TO_FIVE          #language en-US "Limit to Five"
#string  STR_SATA_FUNC_LEV_EN          #language en-US "Function Level Reset Enabled"
#string  STR_SATA_FUNC_LEV_EN_HELP          #language en-US "Enable Function Level Reset in BIOS"

#string  STR_SATA_GEN          #language en-US "Force SATA Speed setting"
#string  STR_GEN_HELP          #language en-US "Gen1/Gen2/Gen3"
#string  STR_GEN1          #language en-US "Gen1"
#string  STR_GEN2          #language en-US "Gen2"
#string  STR_GEN3          #language en-US "Gen3"
#string  STR_AHCI_GEN          #language en-US "Force SATA Speed setting"
#string  STR_SATA_MPLLGATE          #language en-US "Support SATA EPHY MPLL Gate"
#string  STR_AHCI_MSI           #language en-US "AHCI Support MSI"
#string  STR_AHCI_MSIX          #language en-US "AHCI Support MSIX"
#string  STR_AHCI_SGPIO          #language en-US "Support SGPIO"

#string  STR_SB_IDE_LINUX_PATCH       #language en-US "Linux Installation Patch"
#string  STR_SB_IDE_LINUX_PATCH_HELP  #language en-US "Modify device id to patch linux installation"






#string STR_CND003_MODE_SEL				  #language en-US "CND003 Mode Select"
#string STR_BIOS_MODE                              #language en-US "BIOS mode"
#string STR_SPI_MODE                              #language en-US "SPI mode"
#string STR_CND003_PHYB_CFG					 #language en-US "CND003 PHYB CFG"
#string STR_CND003_PHYA_CFG					 #language en-US "CND003 PHYA CFG"
#string STR_CND003_PHYCFG_0					  #language en-US "CFG 0"
#string STR_CND003_PHYCFG_1					  #language en-US "CFG 1"
#string STR_CND003_PHYCFG_2					  #language en-US "CFG 2"
#string STR_CND003_PHYCFG_3					  #language en-US "CFG 3"  
#string STR_CND003_CAP_EP				#language en-US "Cnd003 EP cap"
#string STR_CND003_CAP_PEA0				#language en-US "Cnd003 PEA0 cap"
#string STR_CND003_CAP_PEA1				#language en-US "Cnd003 PEA1 cap"
#string STR_CND003_CAP_PEA2				#language en-US "Cnd003 PEA2 cap"
#string STR_CND003_CAP_PEA3				#language en-US "Cnd003 PEA3 cap"
#string STR_CND003_CAP_PEA4				#language en-US "Cnd003 PEA4 cap"
#string STR_CND003_CAP_PEB0				#language en-US "Cnd003 PEB0 cap"
#string STR_CND003_CAP_PEB1				#language en-US "Cnd003 PEB1 cap"
#string STR_CAP_GEN1					#language en-US "Gen1"
#string STR_CAP_GEN2					#language en-US "Gen2"
#string STR_CAP_GEN3					#language en-US "Gen3"
#string STR_CND003_CAP_PESB				#language en-US "Cnd003 PESB cap"

#string STR_CND003_DBG_SEL_FROM_CPU		#language en-US "Cnd003 DBG Sel"
#string STR_CND003_MODULE_G0			#language en-US "Cnd003 Module G0"
#string STR_CND003_MODULE_G1			#language en-US "Cnd003 Module G1"
#string STR_CND003_G0					#language en-US "Cnd003 G0"
#string STR_CND003_G1					#language en-US "Cnd003 G1"
#string STR_CND003_G2					#language en-US "Cnd003 G2"
#string STR_CND003_G3					#language en-US "Cnd003 G3"
#string STR_CND003_DBG_MMIO				#language en-US "MMIO"
#string STR_CND003_DBG_SMBUS			#language en-US "SMBus"
#string STR_CND003_DBG_HIGH				#language en-US "CNd003 DBG HighSpeed"

/**
#string STR_CND003_DBG_HIGH_HELP         #language en-US "When Enabled,<Cnd003 Module G0> can be used to select:0-CLK,1-PCIEIF,2-EPTRFC,3-ISB_BusXD0F0_CORE,4-DBGMCU,5-SATA,6-D14_USBC,7-D16_USBC,8-GNIC,9-DBG_CAP,A-XHCI,B-PCIE; <Cnd003 G0> used to select one DebugGroup" 
#string STR_CND003_MODULE_G0_HELP		  #language en-US "When set to <A>, <Cnd003 Module G1> can be used to select: (0)CLK (1)SPI (2)SPIARB (3)SMB (4)PCIEIF_SUS (5)ISB_BUSXD0F0_SUS (6)TOPPMU (7)USBC_SUS_D14 (8)USBC_SUS_D16 (9)GNIC_SUS (A)EFUSE (B)TOP; <G0-G3> used to select DebugGroup"
#string STR_CND003_DBG_SEL_FROM_CPU_HELP			#language en-US "(Disable)Use SPI rom (SMBus)Use SMBus (MMIO)Use MMIO_ISB"
**/
#string STR_CND003_DBG_SUS				#language en-US "CND003 DBG Suspend Module"
#string STR_CND003_HIGH_MODULE_SEL		#language en-US "CND003 DBG HighSpeed Module"
#string STR_CND003_HIGH_DBG_SEL			#language en-US "CND003 DBG HighSpeed DbgSig"

#string STR_CND003_MODULE_CLK			#language en-US "Clock Counter"
#string STR_CND003_MODULE_PCIEIF		#language en-US "PCIEIF"
#string STR_CND003_MODULE_EPTRFC		#language en-US "EPTRFC"
#string STR_CND003_MODULE_ISB_BUSXD0F0_CORE		#language en-US "ISB_BUSXD0F0_CORE"
#string STR_CND003_MODULE_DBGMCU		#language en-US "DBGMCU"
#string STR_CND003_MODULE_SATA		#language en-US "SATA"
#string STR_CND003_MODULE_USBC_CORE_D14		#language en-US "USBC_CORE_D14"
#string STR_CND003_MODULE_USBC_CORE_D16		#language en-US "USBC_CORE_D16"
#string STR_CND003_MODULE_GNIC		#language en-US "GNIC"
#string STR_CND003_MODULE_TOP		#language en-US "TOP"
#string STR_CND003_MODULE_ISB_SUS		#language en-US "ISB_SUS"
#string STR_CND003_MODULE_INTMAP		#language en-US "INTMAP"
#string STR_CND003_MODULE_DBGCAP		#language en-US "DBGCAP"
#string STR_CND003_MODULE_XHCI		#language en-US "XHCI"
#string STR_CND003_MODULE_PCIE		#language en-US "PCIE"

#string STR_CND003_SUS_CLK				#language en-US "Clock Counter"
#string STR_CND003_SUS_SPI				#language en-US "SPI"
#string STR_CND003_SUS_SPIARB			#language en-US "SPIARB"
#string STR_CND003_SUS_SMB				#language en-US "SMB"
#string STR_CND003_SUS_PCIEIF_SUS			#language en-US "PCIEIF_SUS"
#string STR_CND003_SUS_ISB_BUSXD0F0_SUS		#language en-US "ISB_BUSXD0F0_SUS"
#string STR_CND003_SUS_TOPPMU			#language en-US "TOPPMU"
#string STR_CND003_SUS_USBC_SUS_D14			#language en-US "USBC_SUS_D14"
#string STR_CND003_SUS_USBC_SUS_D16			#language en-US "USBC_SUS_D16"
#string STR_CND003_SUS_GNIC_SUS			#language en-US "GNIC_SUS"
#string STR_CND003_SUS_EFUSE			#language en-US "EFUSE"
#string STR_CND003_SUS_TOP				#language en-US "TOP"

#string STR_CND003_HIGH_CLK 			#language en-US "Clock Counter"
#string STR_CND003_HIGH_PCIEIF 			#language en-US "PCIEIF"
#string STR_CND003_HIGH_EPRFC			#language en-US "EPRFC"
#string STR_CND003_HIGH_ISB_BUSXD0F0_CORE 			#language en-US "ISB_BUSXD0F0_CORE"
#string STR_CND003_HIGH_DBGMCU			#language en-US "DBGMCU"
#string STR_CND003_HIGH_SATA			#language en-US "SATA"
#string STR_CND003_HIGH_D14_USBC 			#language en-US "D14_USBC"
#string STR_CND003_HIGH_D16_USBC			#language en-US "D16_USBC"
#string STR_CND003_HIGH_GNIC			#language en-US "GNIC"
#string STR_CND003_HIGH_DBGCAP 			#language en-US "DBGCAP"
#string STR_CND003_HIGH_XHCI			#language en-US "XHCI"
#string STR_CND003_HIGH_PCIE			#language en-US "PCIE"

#string STR_CND003_HIDE_XBCTL			#language en-US "CND003 HideXbctl"
#string STR_CND003_HIDE_EPTRFC			#language en-US "CND003 HideEptrfc"

#string STR_CND003_TCX_FAVOR			#language en-US "CND003 TCx Favor Mechanism"
#string STR_CND003_TCX_FAVOR_HELP		#language en-US "Enable/Disable TC7 Favor Mechanism"

#string STR_CND003_DN_PORT_CTL			#language en-US "IOE DN Port Control"
#string STR_CND003_PEA0_CTL				#language en-US "IOE PEA0 Control"
#string STR_CND003_PEA1_CTL				#language en-US "IOE PEA1 Control"
#string STR_CND003_PEA2_CTL				#language en-US "IOE PEA2 Control"
#string STR_CND003_PEA3_CTL				#language en-US "IOE PEA3 Control"
#string STR_CND003_PEA4_CTL				#language en-US "IOE PEA4 Control"
#string STR_CND003_PEB0_CTL				#language en-US "IOE PEB0 Control"
#string STR_CND003_PEB1_CTL				#language en-US "IOE PEB1 Control"
#string STR_IOE_SPEVALUE				#language en-US "IOE SPE value setting"   



#string STR_IOE_CND003                          #language en-US "IOE(CND003)"
#string STR_IOE_SPEVALUE                        #language en-US "CND003 S/P/E Setting"
#string STR_IOE_GNIC_SPEVALUE                   #language en-US "D13F0 (IOE GNIC)"
#string STR_IOE_SATA_SPEVALUE                   #language en-US "D15F0 (IOE SATA)"
#string STR_IOE_XHCI_SPEVALUE                   #language en-US "D18F0 (IOE XHCI)"
#string STR_IOE_EHCI_SPEVALUE                   #language en-US "D16F7 (IOE EHCI)"
#string STR_IOE_UHCI_SPEVALUE                   #language en-US "D16F0-2 (IOE UHCI)"
#string STR_IOE_BUSX_SPEVALUE 					#language en-US "BusX D0F0 (Upstream port)"
#string STR_IOE_BUSXP1D0F0_SPEVALUE 			#language en-US "BusX+1 D0F0 (XBCTL)"
#string STR_IOE_BUSXP1D1F0_SPEVALUE 			#language en-US "BusX+1 D1F0 (PEA0)"
#string STR_IOE_BUSXP1D2F0_SPEVALUE 			#language en-US "BusX+1 D2F0 (PEA1)"
#string STR_IOE_BUSXP1D3F0_SPEVALUE 			#language en-US "BusX+1 D3F0 (PEA2)"
#string STR_IOE_BUSXP1D4F0_SPEVALUE 			#language en-US "BusX+1 D4F0 (PEA3)"
#string STR_IOE_BUSXP1D5F0_SPEVALUE 			#language en-US "BusX+1 D5F0 (PEA4)"
#string STR_IOE_BUSXP1D6F0_SPEVALUE 			#language en-US "BusX+1 D6F0 (PEB0)"
#string STR_IOE_BUSXP1D7F0_SPEVALUE 			#language en-US "BusX+1 D7F0 (PEB1)"
#string STR_IOE_BUSXP1D8F0_SPEVALUE 			#language en-US "BusX+1 D8F0 (PESB)"
#string STR_IOE_BUSXP2D0F0_SPEVALUE 			#language en-US "BusX+2 D0F0 (PCIEIF)"
#string STR_IOE_BUSXP3D0F0_SPEVALUE 			#language en-US "BusX+3 D0F0 (EPTRFC)"
#string STR_IOE_BUSXEPHY_SPEVALUE 				#language en-US "PCIE PHY"
#string STR_IOE_BUSXMMIOISB_SPEVALUE 			#language en-US "MMIO ISB"


#string STR_IOE_DEBUG_SUS_XX                                #language en-US "Suspend [CorePowerOff]"
#string STR_IOE_DEBUG_SUS_XX_HELP                           #language en-US "When enable this, only Group1 can be used for debug signal selection"     

#string STR_MANUAL                  #language en-US "Manual"
#string STR_S                  #language en-US "S"
#string STR_P_S                  #language en-US "P->S"
#string STR_E_P_S                  #language en-US "E->P->S" 

#string STR_IOE_DEBUG_PAD_G0   						#language en-US "GPIO->Debug Signal[15:0]"	  		
#string STR_IOE_DEBUG_PAD_G0_HELP					#language en-US "GPIO Related IOs Used as Debug Signal"			
#string STR_IOE_DEBUG_PAD_G1   						#language en-US "USBOC->Debug Signal[26:16]"	  		
#string STR_IOE_DEBUG_PAD_G1_HELP					#language en-US "USBOC Related IO Used for Debug Signal"	
#string STR_IOE_DEBUG_PAD_G2   						#language en-US "CCPHY->Debug Signal[30:27]"	  		
#string STR_IOE_DEBUG_PAD_G2_HELP					#language en-US "CCPHY Related IO Used for Debug Signal"
#string STR_IOE_DEBUG_PAD_G3   						#language en-US "RGMII->Debug Signal[44:31]"	  		
#string STR_IOE_DEBUG_PAD_G3_HELP					#language en-US "RGMII Related IO Used for Debug Signal"


#string STR_IOE_DBGCAP_FORM					#language en-US "DBGCAP setup"
#string STR_IOE_UP_LINK_WIDTH                  #language en-US "Cnd003LinkWidth"
#string STR_IOE_LW_DRP                 #language en-US "Depend on RP"
#string STR_IOE_LW_AUTO                 #language en-US "Auto"
#string STR_IOE_LW_X4                 #language en-US "X4"
#string STR_IOE_LW_X2                 #language en-US "X2"
#string STR_IOE_LW_X1                 #language en-US "X1"
#string STR_IOE_UART_PIN                 #language en-US "Enable UART Tx/Rx"
#string STR_IOE_DBGCAP                 #language en-US "DBGCAP"
#string STR_IOE_SBDBG                 #language en-US "SBDBG"
#string STR_IOE_DBGSIGNAL                 #language en-US "DbgSignal"
#string STR_IOE_DC_MODULE_SEL                 #language en-US "module selection"
#string STR_IOE_DC_SATA                #language en-US "SATA"
#string STR_IOE_DC_XHCI                #language en-US "XHCI"
#string STR_IOE_DC_GNIC                #language en-US "GNIC"
#string STR_IOE_DC_MCU                 #language en-US "MCU"
#string STR_IOE_DC_D14F012                 #language en-US "D14F0/1/2"
#string STR_IOE_DC_D14F7                 #language en-US "D14F7"
#string STR_IOE_DC_D16F012                #language en-US "D16F0/1/2"
#string STR_IOE_DC_D16F7                #language en-US "D16F7"
#string STR_IOE_DC_TRANS                 #language en-US "transcation selection"
#string STR_IOE_DC_DNRW                 #language en-US "DownStream R/W"
#string STR_IOE_DC_UPW                 #language en-US "Upstream W"
#string STR_IOE_DC_UPR                 #language en-US "Upstream R"
#string STR_IOE_DC_ALL                 #language en-US "All cycle"
#string STR_IOE_DC_CFGPATH                 #language en-US "configure path"
#string STR_IOE_DC_CFGPATH_CPU                 #language en-US "From CPU(EPTRFC)"
#string STR_IOE_DC_CFGPATH_SMBUS                 #language en-US "From SMBus"
#string STR_IOE_DC_CHANNEL_SEL                 #language en-US "channel selection"
#string STR_IOE_DC_DBG0_MASK                 #language en-US "DBG0_MASK"
#string STR_IOE_DC_DBG1_MASK                 #language en-US "DBG1_MASK"
#string STR_IOE_DC_TRIGGER_MODE                 #language en-US "Tigger Mode"
#string STR_IOE_DC_TM_IO                 #language en-US "IO trigger mode"
#string STR_IOE_DC_TM_USER                 #language en-US "User trigger mode"
#string STR_IOE_DC_TM_NO_REQ                 #language en-US "No request trigger mode"
#string STR_IOE_DC_TM_REQ_CNT                 #language en-US "Request count trigger mode"
#string STR_IOE_DC_TM_NO_TOG                 #language en-US "No toggle trigger mode"
#string STR_IOE_DC_TM_REQ_PLUS                 #language en-US "Request plus data trigger mode"
#string STR_IOE_DC_TM_DATA                 #language en-US "Data trigger mode"
#string STR_IOE_DC_TM_REQ                 #language en-US "Request trigger mode"
#string STR_IOE_DC_REQPTN                  #language en-US "Request patten"
#string STR_IOE_DC_REQPTN_MASK                 #language en-US "Request patten mask"
#string STR_IOE_DC_DATAPTN                 #language en-US "Data patten"
#string STR_IOE_DC_DATAPTN_MASK                 #language en-US "Data patten mask"
#string STR_IOE_DC_PLUSTIMER                 #language en-US "Plus timer"
#string STR_IOE_DC_START_TIMER                 #language en-US "Start timer"
#string STR_IOE_DC_PERIOD_TIMER                 #language en-US "Period timer"
#string STR_IOE_DC_REQ_CNT                 #language en-US "Request count"


#string STR_IOE_RST                 #language en-US "Dn ports Rst"
#string STR_IOE_PEA0_RST                 #language en-US "PEA0Rst"
#string STR_IOE_PEA1_RST                 #language en-US "PEA1Rst"
#string STR_IOE_PEA2_RST                 #language en-US "PEA2Rst"
#string STR_IOE_PEA3_RST                 #language en-US "PEA3Rst"
#string STR_IOE_PEA4_RST                 #language en-US "PEA4Rst"
#string STR_IOE_PEB0_RST                 #language en-US "PEB0Rst"
#string STR_IOE_PEB1_RST                 #language en-US "PEB1Rst"

#string STR_IOE_DC_OUT_PEA0				 #language en-US "->PEA0"
#string STR_IOE_DC_OUT_PEA1				 #language en-US "->PEA1"
#string STR_IOE_DC_OUT_PEA2				 #language en-US "->PEA2"
#string STR_IOE_DC_OUT_PEA3				 #language en-US "->PEA3"
#string STR_IOE_DC_OUT_PEA4				 #language en-US "->PEA4"
#string STR_IOE_DC_OUT_PEB0				 #language en-US "->PEB0"
#string STR_IOE_DC_OUT_PEB1				 #language en-US "->PEB1"
#string STR_IOE_DC_OUTPUT   			 #language en-US "OutputPciePort"  


#string STR_IOE_EQ					 #language en-US "PCIe Gen3 EQ"
#string STR_IOE_AUTOFILL_FW			#language en-US "FW Autofill"
#string STR_IOE_DO_EQ				#language en-US "DO_EQ"
#string STR_IOE_SKIP_MANUAL			#language en-US "SKIP_EQ_Manual"
#string STR_IOE_SKIP_TABLE			#language en-US "SKIP_EQ_Table"

#string STR_IOE_SW_DEBUG_1			#language en-US "SwDebug-1"
#string STR_IOE_SW_DEBUG_2			#language en-US "SwDebug-2"
#string STR_IOE_BOOT_ERROR_CLEAR    #language en-US "BootSeq-ErrorClear"
#string STR_IOE_BOOT_ERROR_CLEAR_HELP    #language en-US "Enable to clear AER error status for PEXRST in IOE Boot Sequence"

#string STR_IOE_FORCE_MPS_128B		#language en-US "MaxPayloadSize 128B for IOE"
#string STR_IOE_FORCE_MPS_128B_HELP		#language en-US "The implement for this is to change the MaxPayloadSize Supported field of PEEP to Max128B"
#string STR_IOE_AUTO		#language en-US "AUTO"

#string STR_IOE_SW_CTL_DN_LINKUP		#language en-US "SW to control IOE DN port's linkup"
#string STR_IOE_SW_CTL_DN_LINKUP_HELP		#language en-US "If there was no circuit for IOE GPIO7 to control DN port linkup, pls set to 'Force Disable'"
#string STR_IOE_FORCE_DISABLE		#language en-US "Force Disable"

#string STR_IOE_PEXRST  #language en-US "DN Port PEXRST# CTL"
#string STR_IOE_PEXRST_HELP  #language en-US "To control the PEXRST of DN ports"
#string STR_IOE_PEXRST_PEA0  #language en-US "PEA0-PEXRST#"
#string STR_IOE_PEXRST_PEA1  #language en-US "PEA1-PEXRST#"
#string STR_IOE_PEXRST_PEA2  #language en-US "PEA2-PEXRST#"
#string STR_IOE_PEXRST_PEA3  #language en-US "PEA3-PEXRST#"
#string STR_IOE_PEXRST_PEA4  #language en-US "PEA4-PEXRST#"
#string STR_IOE_PEXRST_PEB0  #language en-US "PEB0-PEXRST#"
#string STR_IOE_PEXRST_PEB1  #language en-US "PEB1-PEXRST#"

#string STR_IOE_RPCIE_PU_IO 	#language en-US "RPCIE_PU_IO"
#string STR_IOE_RPCIE_TNO_IO  	#language en-US "RPCIE_TNO_IO"

#string STR_IOE_CHANGE_SID_FOR_ISB  	#language en-US "Change SID for ISB"
#string STR_IOE_CHANGE_SID_FOR_ISB_HELP  	#language en-US "When Enable this,Completion Timeout will also be disabled, this is HW limitation"







